[
  {
    "id": 1,
    "name": "HONDA WR-V",
    "description": "The Honda WR-V has 1 Diesel Engine and 1 Petrol Engine on offer. The Diesel engine is 1498 cc while the Petrol engine is 1199 cc. It is available with Manual transmission.Depending upon the variant and fuel type the WR-V has a mileage of 16.5 to 23.7 kmpl. With New Action-Packed Features, Aggressive Front Grille and LED Eyes That Shine With Excitement, The New WR-V is Daring To Go. Comfortable Spacious Exclusively Designed Interiors That Keep Your Adventures Frequent And Your Drives Daring To Go.",
    "price": "7500",
    "img": "https://h-h-auto.de/wp-content/uploads/2019/12/2F4O2Fk2.jpg",
    "features": {
      "bodyStyle": "5-door SUV",
      "engine": "i-DTEC Diesel engine",
      "fuelType": "Diesel",
      "fuelMileage": "23.7 kmpl",
      "condition": "Brand New",
      "warenty": "3 Years Limited"
    }
  },
  {
    "id": 2,
    "name": "Lamborghini Countach LPI 800-4",
    "description": "The Lamborghini Countach LPI 800-4 is a mid-engine hybrid-electric sports car produced by the Italian automotive manufacturer Lamborghini. Thus, it was only a matter of time until the Italian brand dusted the white powder off the old Countach nameplate and affixed it to something new, in this case, the 2022 Lamborghini Countach LPI 800-4. The Countach LPI 800-4's design inspiration comes from a car that first went on sale in the disco era, but its powertrain embraces thoroughly modern technology. Credit the car's 34-hp electric motor that's mounted directly to the Countach LPI 800-4's seven-speed automated manual gearbox, which itself mates to a rowdy 769 hp 6.5-liter V-12 engine.",
    "price": "8000",
    "img": "https://cdn.motor1.com/images/mgl/RG9mg/s1/lamborghini-countach-lpi-800-4.jpg",
    "features": {
      "bodyStyle": "2-door Coupe",
      "engine": "6.5 L L539 V12",
      "fuelType": "Gasoline",
      "fuelMileage": "6.4 kmpl",
      "condition": "Brand New",
      "warenty": "3 Years Limited"
    }
  },
  {
    "id": 3,
    "name": "Ferrari 812",
    "description": "The most powerful, naturally-aspirated, super GT Ferrari ever made - the 812 Superfast - has been launched in India at Rs 5.2 crore (ex-showroom pan-India). The 812 Superfast is the successor to the F12 Berlinetta, which was on sale in the country since 2015. It is powered by a 6.5-litre, naturally-aspirated V12 petrol engine capable of producing 800PS of power and 718Nm of torque. In order to control such bonkers performance, Ferrari has fitted it with the latest generation of their four-wheel steering technology referred to as Virtual Short Wheelbase.",
    "price": "9000",
    "img": "https://cdn1.mecum.com/auctions/fl0121/fl0121-455476/images/2-1608587761111@2x.jpg?1610813498000",
    "features": {
      "bodyStyle": "Coupe",
      "engine": "6.5 L F140 GA V12",
      "fuelType": "Petrol",
      "fuelMileage": "7.0 kmpl",
      "condition": "Brand New",
      "warenty": "3 Years Limited"
    }
  },
  {
    "id": 4,
    "name": "BMW X7",
    "description": "A statement of the luxury class: the new BMW X7 is the elegant fusion of presence and personality. Despite its majestic appearance, it gives an impression of lightness and agility thanks to the puristic design and athletic styling. At the same time, the considerable spaciousness of the interior offers a pioneering interplay of exclusivity, functionality and freedom – incomparable comfort all the way to the third row of seats. Charm is its essence. Elegance its character.",
    "price": "8500",
    "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bmw-x7-x50i-101-1552690974.jpg?crop=1.00xw:0.822xh;0,0.178xh&resize=480:*",
    "features": {
      "bodyStyle": "5-door SUV",
      "engine": "TwinPower Turbo 6-cylinder engine",
      "fuelType": "Petrol",
      "fuelMileage": "10.54 kmpl",
      "condition": "Brand New",
      "warenty": "3 Years Limited"
    }
  },
  {
    "id": 5,
    "name": "Toyota C-HR",
    "description": "The new, 2020 Toyota C-HR builds on the striking design language and outstanding dynamic performance that has already awarded the company’s C-SUV segment iconic status within the Toyota model range. Most significantly, the new, 2020 Toyota C-HR benefits from a second, more powerful hybrid system added to the powertrain range. It also features enhanced driving dynamics, more refined interior and exterior design, and an upgraded HMI featuring the latest multimedia technology",
    "price": "10000",
    "img": "https://i.ytimg.com/vi/OQ3xUhXcWqE/maxresdefault.jpg",
    "features": {
      "bodyStyle": "5-door SUV",
      "engine": "1.2 L 8NR-FTS VVT-iW turbo",
      "fuelType": "Petrol",
      "fuelMileage": "3.4 gals/100 miles",
      "condition": "Brand New",
      "warenty": "3 Years Limited"
    }
  },
  {
    "id": 6,
    "name": "Mercedes-Benz AMG GLC 43",
    "description": "The new Mercedes-AMG GLC 43 Coupé offers typical AMG sportiness and yet typical Mercedes-Benz comfort too. With its enhanced performance from its 3.0 liter V6 biturbo engine, you will be significantly more agile on the road and with more lateral dynamics to boot: Driving pleasure for the performance-oriented. The typical Coupé line design additionally accentuates its high performance. At the rear you can recognize the engine directly on the diffuser with the round double end pipe panels of the AMG exhaust system.",
    "price": "9500",
    "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2020-mercedes-amg-glc43-suv-103-1563402051.jpg?crop=0.913xw:0.746xh;0.0865xw,0.147xh&resize=1200:*",
    "features": {
      "bodyStyle": "Coupe",
      "engine": "twin-turbocharged 3.0-liter V-6",
      "fuelType": "Petrol",
      "fuelMileage": "9.5 kmpl",
      "condition": "Brand New",
      "warenty": "3 Years Limited"
    }
  },
  {
    "id": 7,
    "name": "Lamborghini Gallardo LP560-4",
    "description": "The Gallardo LP 560-4 was a significant update of the Gallardo, powered by a new, uneven firing 5.2 L (5,200 cc; 320 cu in) V10 engine that produces 560 PS (412 kW; 552 hp) at 8,000 rpm and 540 N⋅m (398 lb⋅ft) of torque at 6,500 rpm. The new engine, 40 PS (29 kW; 39 hp) more powerful than in the previous car, comes with two transmission choices: a 6-speed manual or 6-speed E-gear, the latter of which was revised to offer a Corsa mode which makes 40% quicker shifts than before and decreases traction control restrictions, a Thrust Mode launch control system was also added.",
    "price": "9500",
    "img": "https://www.gtspiritmedia.com/gtspirit/uploads/2012/11/Photo-Of-The-Day-Yellow-Lamborghini-Gallardo-LP560-4-by-Speed-Photos.jpg",
    "features": {
      "bodyStyle": "2-door Coupe",
      "engine": "Naturally-aspirated DOHC 90° 40-valve V10",
      "fuelType": "Petrol",
      "fuelMileage": "6.4 kmpl",
      "condition": "Brand New",
      "warenty": "3 Years Limited"
    }
  },

  {
    "id": 8,
    "name": "Ferrari F8 Tributo",
    "description": "The Ferrari F8 Tributo is the new mid-rear-engined sports car that represents the heght expression of the Prancing Horse's classic two-seater berelinetta. It is a car with unique characteristics and, as its name implies, is an homage to the most powerful V8 in Ferrari history. The F8 Tributo replaces the 488 GTB, with improvements across the board, providing even better control on the limit along with greater on-board comfort. Designed by the Ferrari Styling Centre, the F8 Tributo is essentially a bridge to a new design language that will continue to emphasize Ferrari’s key characteristics of high performance and extreme aerodynamic efficiency.",
    "price": "8000",
    "img": "https://o.aolcdn.com/images/dims3/GLOB/legacy_thumbnail/800x450/format/jpg/quality/85/https://s.aolcdn.com/os/ab/_cms/2019/08/29163235/ferrari-f8-tributo-fd-06.jpg",
    "features": {
      "bodyStyle": "Coupe",
      "engine": "3.9 L F154CD twin-turbo V8",
      "fuelType": "Petrol",
      "fuelMileage": "7.75 kmpl",
      "condition": "Brand New",
      "warenty": "3 Years Limited"
    }
  },

  {
    "id": 9,
    "name": "BMW Z4",
    "description": "The Z4 is the latest in a long line of two-seat RWD convertibles from BMW. Built in collaboration with Toyota, the current-generation Z4 is closely related to the Supra. Unlike its cousin, the Z4 is more of a cruiser than a tail-happy sports car. The latest Z4 swaps the last-gen model's power hardtop for a soft top that you can raise or lower in 10 seconds at speeds of up to 31 mph. Ditching the folding hardtop also added more trunk space. In addition to the standard turbo-four Z4, the six-cylinder M40i variant is available for drivers who want something faster.",
    "price": "10500",
    "img": "https://www.carhelpcanada.com/wp-content/uploads/2019/10/2020-BMW-Z4-4.jpeg",
    "features": {
      "bodyStyle": "Convertible",
      "engine": "2.0 L B48 turbocharged I4 3.0 L B58 turbocharged I6",
      "fuelType": "Petrol",
      "fuelMileage": "11.29 kmpl",
      "condition": "Brand New",
      "warenty": "3 Years Limited"
    }
  },
  {
    "id": 10,
    "name": "Audi A8",
    "description": "The powerful Audi A8 L is equipped with a standard 3.0-liter turbocharged V6 engine, while offering an available 3.0-liter Plug-in hybrid (60 TFSI e) and 4.0-liter twin-turbocharged engine. A look around the Audi A8 will help you gain perspective on design sophistication. Let your eyes travel effortlessly over its balanced proportions and linger on the beauty of the finer details. With the help of the Audi rear Media Control app, the optional screens in the rear can display content, such as video streams or games, from mobile Android and iOS devices.",
    "price": "10000",
    "img": "https://media.ed.edmunds-media.com/audi/a8/2021/oem/2021_audi_a8_sedan_l_fq_oem_1_1280.jpg",
    "features": {
      "bodyStyle": "4-door sedan",
      "engine": "453-hp twin-turbo V-8",
      "fuelType": "Petrol",
      "fuelMileage": "11.7 kmpl",
      "condition": "Brand New",
      "warenty": "3 Years Limited"
    }
  }
]
